<!--
Automatically generated HTML file from DocOnce source
(https://github.com/hplgit/doconce/)
-->
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="DocOnce: https://github.com/hplgit/doconce/" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="description" content="Типы коллекций">

<title>Типы коллекций</title>

<!-- Bootstrap style: bootswatch_flatly -->
<link href="https://netdna.bootstrapcdn.com/bootswatch/3.1.1/flatly/bootstrap.min.css" rel="stylesheet">
<!-- not necessary
<link href="https://netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css" rel="stylesheet">
-->

<style type="text/css">
/* Let inline verbatim have the same color as the surroundings */
code { color: inherit; background-color: transparent; }

/* Add scrollbar to dropdown menus in bootstrap navigation bar */
.dropdown-menu {
   height: auto;
   max-height: 400px;
   overflow-x: hidden;
}

/* Adds an invisible element before each target to offset for the navigation
   bar */
.anchor::before {
  content:"";
  display:block;
  height:60px;      /* fixed header height for style bootswatch_flatly */
  margin:-60px 0 0; /* negative fixed header height */
}

body { font-size:20px; }
</style>




<!-- Tools for embedded Bokeh plots -->
<link rel=stylesheet 
      href=https://cdn.pydata.org/bokeh/release/bokeh-0.12.4.min.css 
      type=text/css />
<script type=text/javascript 
        src=https://cdn.pydata.org/bokeh/release/bokeh-0.12.4.min.js>
</script>
<script type=text/javascript>
  Bokeh.set_log_level("info");
</script>

<style>
.bk-embeded {
    width: 100%;
    margin: auto;
    height: 500px;
    text-align: webkit-left;
}
</style>


</head>


<!-- tocinfo
{'highest level': 1,
 'sections': [('Содержание',
               1,
               'table_of_contents',
               'table_of_contents'),
              ('Последовательности', 1, 'collections:seq', 'collections:seq'),
              ('Кортежи',
               2,
               'collections:seq:tuples',
               'collections:seq:tuples'),
              ('Именованные кортежы',
               2,
               'collections:seq:namedtuple',
               'collections:seq:namedtuple'),
              ('Списки', 2, 'collections:seq:lists', 'collections:seq:lists'),
              ('Генераторы списков',
               3,
               'collections:seq:lists:gen',
               'collections:seq:lists:gen'),
              ('Множества', 1, 'collections:sets', 'collections:sets'),
              ('Тип `set`', 2, 'collections:sets:set', 'collections:sets:set'),
              ('Генераторы множеств',
               3,
               'collections:sets:gen',
               'collections:sets:gen'),
              ('Тип `frozenset`',
               2,
               'collections:sets:frozenset',
               'collections:sets:frozenset'),
              ('Отображения', 1, 'collections:maps', 'collections:maps'),
              ('Словари', 2, 'collections:maps:dict', 'collections:maps:dict'),
              ('Генераторы словарей',
               3,
               'collections:maps:dict:gen',
               'collections:maps:dict:gen'),
              ('Словари со значениями по умолчанию',
               2,
               'collections:maps:defaultdict',
               'collections:maps:defaultdict'),
              ('Обход в цикле и копирование коллекций',
               1,
               'collections:iterandcopy',
               'collections:iterandcopy'),
              ('Итераторы, функции и операторы для работы с итерируемыми '
               'объектами',
               2,
               'collections:iterandcopy:iterator',
               'collections:iterandcopy:iterator'),
              ('Копирование коллекций',
               2,
               'collections:iterandcopy:copy',
               'collections:iterandcopy:copy'),
              ('Примеры', 1, 'collections:examples', 'collections:examples')]}
end of tocinfo -->

<body>



<script type="text/x-mathjax-config">
MathJax.Hub.Config({
  TeX: {
     equationNumbers: {  autoNumber: "none"  },
     extensions: ["AMSmath.js", "AMSsymbols.js", "autobold.js", "color.js"]
  }
});
</script>
<script type="text/javascript" async
 src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.1/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>



    
<!-- Bootstrap navigation bar -->
<div class="navbar navbar-default navbar-fixed-top">
  <div class="navbar-header">
    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-responsive-collapse">
      <span class="icon-bar"></span>
      <span class="icon-bar"></span>
      <span class="icon-bar"></span>
    </button>
    <a class="navbar-brand" href="collections-flatly.html">Типы коллекций</a>
  </div>

  <div class="navbar-collapse collapse navbar-responsive-collapse">
    <ul class="nav navbar-nav navbar-right">
      <li class="dropdown">
        <a href="#" class="dropdown-toggle" data-toggle="dropdown">Contents <b class="caret"></b></a>
        <ul class="dropdown-menu">
     <!-- navigation toc: --> <li><a href="._collections-flatly000.html#table_of_contents" style="font-size: 80%;"><b>Содержание</b></a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly001.html#collections:seq" style="font-size: 80%;"><b>Последовательности</b></a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly001.html#collections:seq:tuples" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Кортежи</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly001.html#collections:seq:namedtuple" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Именованные кортежы</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly001.html#collections:seq:lists" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Списки</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly001.html#collections:seq:lists:gen" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Генераторы списков</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly002.html#collections:sets" style="font-size: 80%;"><b>Множества</b></a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly002.html#collections:sets:set" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Тип <code>set</code></a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly002.html#collections:sets:gen" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Генераторы множеств</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly002.html#collections:sets:frozenset" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Тип <code>frozenset</code></a></li>
     <!-- navigation toc: --> <li><a href="#collections:maps" style="font-size: 80%;"><b>Отображения</b></a></li>
     <!-- navigation toc: --> <li><a href="#collections:maps:dict" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Словари</a></li>
     <!-- navigation toc: --> <li><a href="#collections:maps:dict:gen" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Генераторы словарей</a></li>
     <!-- navigation toc: --> <li><a href="#collections:maps:defaultdict" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Словари со значениями по умолчанию</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly004.html#collections:iterandcopy" style="font-size: 80%;"><b>Обход в цикле и копирование коллекций</b></a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly004.html#collections:iterandcopy:iterator" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Итераторы, функции и операторы для работы с итерируемыми объектами</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly004.html#collections:iterandcopy:copy" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Копирование коллекций</a></li>
     <!-- navigation toc: --> <li><a href="._collections-flatly005.html#collections:examples" style="font-size: 80%;"><b>Примеры</b></a></li>

        </ul>
      </li>
    </ul>
  </div>
</div>
</div> <!-- end of navigation bar -->

<div class="container">

<p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p> <!-- add vertical space -->

<a name="part0003"></a>
<!-- !split -->

<h1 id="collections:maps" class="anchor">&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</h1>

<p>
&#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080;
&#1085;&#1072; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; (<code>in</code>), &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>len()</code> &#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1093;&#1086;&#1076;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;
&#1094;&#1080;&#1082;&#1083;&#1077;. &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#8211; &#1101;&#1090;&#1086; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1080; &#1087;&#1072;&#1088; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084; &#1080; &#1080;&#1093; &#1082;&#1083;&#1102;&#1095;&#1072;&#1084; &#1080;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084;. &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1076;&#1074;&#1072; &#1090;&#1080;&#1087;&#1072;
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;: &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1081; &#1090;&#1080;&#1087; <code>dict</code> &#1080; &#1090;&#1080;&#1087; <code>collections.defaultdict</code>,
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1077;. &#1052;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1088;&#1084;&#1080;&#1085;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1076;&#1083;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1081; &#1080;&#1079; &#1101;&#1090;&#1080;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1085;&#1080;&#1084;&#1080;
&#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;.

<p>
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1093;&#1077;&#1096;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1090;&#1072;&#1082;&#1080;&#1077; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099;,
&#1082;&#1072;&#1082; <code>float</code>, <code>frozenset</code>, <code>int</code>, <code>str</code> &#1080; <code>tuple</code>, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099;, &#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <code>dict</code>, <code>list</code> &#1080; <code>set</code>, &#8211;
&#1085;&#1077;&#1090;. &#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1082;&#1083;&#1102;&#1095;&#1091; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1086;&#1081; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;, &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072;,
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1089;&#1087;&#1080;&#1089;&#1082;&#1080;, &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1072;, &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080;, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080; &#1090;. &#1076;.

<p>
&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103;
(<code>&lt;</code>, <code>&lt;=</code>, <code>==</code>, <code>!=</code>, <code>&gt;=</code>, <code>&gt;</code>), &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;
&#1087;&#1086;&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1085;&#1086; (&#1080; &#1088;&#1077;&#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1086;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082;
&#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1080; &#1080;&#1083;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;&#1093;). &#1055;&#1086;&#1078;&#1072;&#1083;&#1091;&#1081;, &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080;
&#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1082; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;&#1084; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; <code>==</code> &#1080; <code>!=</code>.

<h2 id="collections:maps:dict" class="anchor">&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080;</h2>

<p>
&#1058;&#1080;&#1087; <code>dict</code> &#8211; &#1101;&#1090;&#1086; &#1085;&#1077;&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1080;&#1079; &#1085;&#1091;&#1083;&#1103; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1072;&#1088;
&#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1093;&#1077;&#1096;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#8211; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;. &#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1082; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074;,
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1077;&#1075;&#1082;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1086; &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080;
&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;, &#1082; &#1085;&#1080;&#1084; &#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1086; &#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077;
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072; &#1080; &#1085;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1084;&#1072; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1088;&#1077;&#1079;&#1072;.

<p>
&#1058;&#1080;&#1087; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <code>dict</code> &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>dict()</code> &#8211; &#1073;&#1077;&#1079;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1086;&#1085;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;; &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1101;&#1090;&#1086;&#1084;
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080;: &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1090;&#1080;&#1087;&#1072; <code>dict</code> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1085;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;. &#1057;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074;
&#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1080;&#1079; &#1076;&#1074;&#1091;&#1093;
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072;, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#8211;
&#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1082; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; 
&#1082;&#1083;&#1102;&#1095;&#1080; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;&#1080; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; &#1103;&#1079;&#1099;&#1082;&#1072; Python, &#1084;&#1086;&#1078;&#1085;&#1086;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;; &#1090;&#1086;&#1075;&#1076;&#1072; &#1080;&#1084;&#1077;&#1085;&#1072; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090;
&#1080;&#1075;&#1088;&#1072;&#1090;&#1100; &#1088;&#1086;&#1083;&#1100; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#8211; &#1088;&#1086;&#1083;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;
&#1082;&#1083;&#1102;&#1095;&#1077;&#1081;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1092;&#1080;&#1075;&#1091;&#1088;&#1085;&#1099;&#1093;
&#1089;&#1082;&#1086;&#1073;&#1086;&#1082; &#8211; &#1087;&#1091;&#1089;&#1090;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080; <code>{}</code> &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1091;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;. &#1053;&#1077;&#1087;&#1091;&#1089;&#1090;&#1099;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;&#1085;&#1099;&#1077;
&#1089;&#1082;&#1086;&#1073;&#1082;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1083;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093;
&#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1080;&#1079; &#1082;&#1083;&#1102;&#1095;&#1072;, &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1076;&#1074;&#1086;&#1077;&#1090;&#1086;&#1095;&#1080;&#1103; &#1080;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#8211; &#1101;&#1090;&#1072; &#1090;&#1077;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1085;&#1080;&#1078;&#1077;, &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;.

<p>
&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#8211; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;
&#1086;&#1076;&#1080;&#1085; &#1080; &#1090;&#1086;&#1090; &#1078;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>d1 <span style="color: #666666">=</span> <span style="color: #008000">dict</span>({<span style="color: #BA2121">&quot;id&quot;</span>: <span style="color: #666666">1948</span>, <span style="color: #BA2121">&quot;name&quot;</span>: <span style="color: #BA2121">&quot;Washer&quot;</span>, <span style="color: #BA2121">&quot;size&quot;</span>: <span style="color: #666666">3</span>})
d2 <span style="color: #666666">=</span> <span style="color: #008000">dict</span>(<span style="color: #008000">id</span><span style="color: #666666">=1948</span>, name<span style="color: #666666">=</span><span style="color: #BA2121">&quot;Washer&quot;</span>, size<span style="color: #666666">=3</span>)
d3 <span style="color: #666666">=</span> <span style="color: #008000">dict</span>([(<span style="color: #BA2121">&quot;id&quot;</span>, <span style="color: #666666">1948</span>), (<span style="color: #BA2121">&quot;name&quot;</span>, <span style="color: #BA2121">&quot;Washer&quot;</span>), (<span style="color: #BA2121">&quot;size&quot;</span>, <span style="color: #666666">3</span>)])
d4 <span style="color: #666666">=</span> <span style="color: #008000">dict</span>(<span style="color: #008000">zip</span>((<span style="color: #BA2121">&quot;id&quot;</span>, <span style="color: #BA2121">&quot;name&quot;</span>, <span style="color: #BA2121">&quot;size&quot;</span>), (<span style="color: #666666">1948</span>, <span style="color: #BA2121">&quot;Washer&quot;</span>, <span style="color: #666666">3</span>)))
d5 <span style="color: #666666">=</span> {<span style="color: #BA2121">&quot;id&quot;</span>: <span style="color: #666666">1948</span>, <span style="color: #BA2121">&quot;name&quot;</span>: <span style="color: #BA2121">&quot;Washer&quot;</span>, <span style="color: #BA2121">&quot;size&quot;</span>: <span style="color: #666666">3</span>}
</pre></div>
<p>
<center> <!-- figure label: --> <div id="collections:maps:fig:1"></div> <!-- FIGURE -->
<hr class="figure">
<center><p class="caption">Рисунок 5:  &#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#8211; &#1101;&#1090;&#1086; &#1085;&#1077;&#1091;&#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; (&#1082;&#1083;&#1102;&#1095;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1089; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;&#1080;  <!-- caption label: collections:maps:fig:1 --> </p></center>
<p><img src="fig-collections/map_1.png" align="bottom" width=800></p>
</center>

<p>
&#1053;&#1072; &#1088;&#1080;&#1089;. <a href="#collections:maps:fig:1">5</a> &#1076;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081;
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>d <span style="color: #666666">=</span> {<span style="color: #BA2121">&quot;root&quot;</span>: <span style="color: #666666">18</span>, <span style="color: #BA2121">&quot;blue&quot;</span>: [<span style="color: #666666">75</span>, <span style="color: #BA2121">&quot;R&quot;</span>, <span style="color: #666666">2</span>], <span style="color: #666666">21</span>: <span style="color: #BA2121">&quot;venus&quot;</span>, <span style="color: #666666">-14</span>: <span style="color: #008000; font-weight: bold">None</span>,
     <span style="color: #BA2121">&quot;mars&quot;</span>: <span style="color: #BA2121">&quot;rover&quot;</span>, (<span style="color: #666666">4</span>, <span style="color: #666666">11</span>): <span style="color: #666666">18</span>, <span style="color: #666666">0</span>: <span style="color: #666666">45</span>}
</pre></div>
<p>
&#1050;&#1083;&#1102;&#1095;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1077;&#1089;&#1083;&#1080; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1072;&#1088;&#1072; &#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1078;&#1077; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1079;&#1072;&#1084;&#1077;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072;
&#1085;&#1086;&#1074;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;. &#1044;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;
&#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080;: &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>d[&quot;root&quot;]</code> &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; <code>18</code>,
&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>d[21]</code> &#1074;&#1077;&#1088;&#1085;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; <code>&quot;venus&quot;</code>, &#1072; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>d[91]</code> 
&#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1102;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1085;&#1072;
&#1088;&#1080;&#1089;. <a href="#collections:maps:fig:1">5</a>, &#1074;&#1086;&#1079;&#1073;&#1091;&#1076;&#1080;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>KeyError</code>.

<p>
&#1050;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;
<code>=</code>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>d[&quot;X&quot;] = 59</code>. &#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; <code>del</code>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; <code>del d[&quot;mars&quot;]</code> &#1091;&#1076;&#1072;&#1083;&#1080;&#1090; &#1080;&#1079; 
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; <code>&quot;mars&quot;</code> &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1073;&#1091;&#1076;&#1080;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>KeyError</code>,
&#1077;&#1089;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;,
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1086;&#1075;&#1091;&#1090; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; (&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;)
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <code>dict.pop()</code>.

<p>
&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>len()</code> &#1080; &#1076;&#1083;&#1103; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1081; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1080; &#1085;&#1072; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; <code>in</code> &#1080; <code>not in</code>. &#1042; &#1090;&#1072;&#1073;&#1083;. <a href="#collections:maps:tbl:1">collections:maps:tbl:1</a>
&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;.

<p>
&#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090; &#1087;&#1072;&#1088;&#1099; &#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187;, &#1091; &#1085;&#1072;&#1089; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1091;&#1090;&#1100;
&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1086;&#1081;&#1090;&#1080; &#1074; &#1094;&#1080;&#1082;&#1083;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; (&#1082;&#1083;&#1102;&#1095;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1087;&#1086;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084; &#1080;&#1083;&#1080; &#1087;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1076;&#1074;&#1072; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1099;&#1093;
&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072; &#1086;&#1073;&#1093;&#1086;&#1076;&#1072; &#1087;&#1072;&#1088; &#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> item <span style="color: #AA22FF; font-weight: bold">in</span> d<span style="color: #666666">.</span>items():
    <span style="color: #008000">print</span>(item[<span style="color: #666666">0</span>], item[<span style="color: #666666">1</span>])
</pre></div>
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> key, value <span style="color: #AA22FF; font-weight: bold">in</span> d<span style="color: #666666">.</span>items():
    <span style="color: #008000">print</span>(key, value)
</pre></div>
<p>
<p class='env-table'><em>&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; 3. &#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; <div id="collections:maps:tbl:1"></div></em>

<p>

<div class="row">
  <div class="col-xs-12">
    <table class="table table-striped table-hover table-condensed">
<thead>
<tr><td align="left"><b>&#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;</b></td> <td align="left"><b>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         &#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        </b></td> </tr>
</thead>
<tbody>
<tr><td align="left">   <code>d.clear()</code>                                             </td> <td align="left">   &#1059;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1079; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>d</code>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                             </td> </tr>
<tr><td align="left">   <code>d.copy()</code>                                              </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1085;&#1091;&#1102; &#1082;&#1086;&#1087;&#1080;&#1102; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>d</code>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      </td> </tr>
<tr><td align="left">   <code>d.fromkeys(s, v)</code>                                      </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1090;&#1080;&#1087;&#1072; <code>dict</code>, &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; <code>s</code> &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1083;&#1080;&#1073;&#1086; <code>None</code> &#1083;&#1080;&#1073;&#1086; <code>v</code>, &#1077;&#1089;&#1083;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <code>v</code> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  </td> </tr>
<tr><td align="left">   <code>d.get(k)</code>                                              </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; <code>k</code> &#1080;&#1083;&#1080; <code>None</code>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1102;&#1095; <code>k</code> &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 </td> </tr>
<tr><td align="left">   <code>d.get(k, v)</code>                                           </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; <code>k</code> &#1080;&#1083;&#1080; <code>v</code>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1102;&#1095; <code>k</code> &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    </td> </tr>
<tr><td align="left">   <code>d.items()</code>                                             </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1087;&#1072;&#1088; (&#1082;&#1083;&#1102;&#1095;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; <code>d</code>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                      </td> </tr>
<tr><td align="left">   <code>d.keys()</code>                                              </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>d</code>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  </td> </tr>
<tr><td align="left">   <code>d.pop(k)</code>                                              </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; <code>k</code> &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1080;&#1079; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; <code>k</code> &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>KeyError</code>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1102;&#1095; <code>k</code> &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                </td> </tr>
<tr><td align="left">   <code>d.pop(k, v)</code>                                           </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1102;&#1095;&#1072; <code>k</code> &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1080;&#1079; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; <code>k</code> &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>v</code>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1102;&#1095; <code>k</code> &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     </td> </tr>
<tr><td align="left">   <code>d.popitem()</code>                                           </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1072;&#1088;&#1091; (&#1082;&#1083;&#1102;&#1095;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1080;&#1079; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>d</code> &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>KeyError</code>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; <code>d</code> &#1087;&#1091;&#1089;&#1090;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            </td> </tr>
<tr><td align="left">   <code>d.setdefault(k, v)</code>                                    </td> <td align="left">   &#1058;&#1086; &#1078;&#1077; &#1095;&#1090;&#1086; &#1080; <code>dict.get()</code> &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1083;&#1102;&#1095; <code>k</code> &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; <code>k</code> &#1080; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; <code>None</code> &#1080;&#1083;&#1080; <code>v</code>, &#1077;&#1089;&#1083;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; <code>v</code> &#1079;&#1072;&#1076;&#1072;&#1085;                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              </td> </tr>
<tr><td align="left">   <code>d.update(a)</code>                                           </td> <td align="left">   &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; <code>d</code> &#1087;&#1072;&#1088;&#1099; (&#1082;&#1083;&#1102;&#1095;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1080;&#1079; <code>a</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; <code>d</code> &#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1078;&#1077; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; <code>d</code> &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1084;&#1077;&#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1079; <code>a</code>; a &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1084; &#1080;&#1090;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1080; (&#1082;&#1083;&#1102;&#1095; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;) &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;    </td> </tr>
<tr><td align="left">   <code>d.values()</code>                                            </td> <td align="left">   &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1089;&#1077;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; <code>d</code>                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            </td> </tr>
</tbody>
    </table>
  </div> <!-- col-xs-12 -->
</div> <!-- cell row -->
</p>

<p>
&#1054;&#1073;&#1093;&#1086;&#1076; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1093;&#1086;&#1078;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> value <span style="color: #AA22FF; font-weight: bold">in</span> d<span style="color: #666666">.</span>values():
    <span style="color: #008000">print</span>(value)
</pre></div>
<p>
&#1044;&#1083;&#1103; &#1086;&#1073;&#1093;&#1086;&#1076;&#1072; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <code>dict.keys()</code>
&#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1082;&#1072;&#1082; &#1080;&#1090;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080; &#1074;&#1099;-
&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1080;&#1090;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1077;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;, &#1082;&#1072;&#1082; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1076;&#1074;&#1091;&#1093;
&#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> key <span style="color: #AA22FF; font-weight: bold">in</span> d:
    <span style="color: #008000">print</span>(key)
</pre></div>
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> key <span style="color: #AA22FF; font-weight: bold">in</span> d<span style="color: #666666">.</span>keys():
    <span style="color: #008000">print</span>(key)
</pre></div>
<p>
&#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;, &#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;
&#1086;&#1073;&#1093;&#1086;&#1076; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1074; &#1094;&#1080;&#1082;&#1083;&#1077; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;
&#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1082;&#1086;&#1073;&#1086;&#1082;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099;
&#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; <code>d</code>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">for</span> key <span style="color: #AA22FF; font-weight: bold">in</span> d:
    d[key] <span style="color: #666666">+=</span> <span style="color: #666666">1</span>
</pre></div>
<p>
&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; <code>dict.items()</code>, <code>dict.keys()</code> &#1080; <code>dict.values()</code> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#8211; &#1101;&#1090;&#1086; &#1074; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1080;&#1090;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1081; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103; &#1080; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;,
&#1082;&#1083;&#1102;&#1095;&#1080; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;
&#1073;&#1099;&#1083;&#1086; &#1079;&#1072;&#1087;&#1088;&#1086;&#1096;&#1077;&#1085;&#1086;.

<h3 id="collections:maps:dict:gen" class="anchor">&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;</h3>

<p>
<em>&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;</em> &#8211; &#1101;&#1090;&#1086; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1094;&#1080;&#1082;&#1083; &#1089; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;&#1084;,
&#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1092;&#1080;&#1075;&#1091;&#1088;&#1085;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;
&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;. &#1055;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1080; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;, &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1076;&#1074;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>{keyexpression: valueexpression <span style="color: #008000; font-weight: bold">for</span> key, value <span style="color: #AA22FF; font-weight: bold">in</span> iterable}
{keyexpression: valueexpression <span style="color: #008000; font-weight: bold">for</span> key, value <span style="color: #AA22FF; font-weight: bold">in</span> iterable <span style="color: #008000; font-weight: bold">if</span> condition}
</pre></div>
<p>
&#1053;&#1080;&#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1082;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1082;&#1083;&#1102;&#1095; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084;
&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#8211; &#1101;&#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>file_sizes <span style="color: #666666">=</span> {name: os<span style="color: #666666">.</span>path<span style="color: #666666">.</span>getsize(name) <span style="color: #008000; font-weight: bold">for</span> name <span style="color: #AA22FF; font-weight: bold">in</span> os<span style="color: #666666">.</span>listdir(<span style="color: #BA2121">&quot;.&quot;</span>)}
</pre></div>
<p>
&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>os.listdir()</code> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; os (&#171;operating system&#187; &#8211; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1072;&#1103;
&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;) &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1080; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1077;, &#1085;&#1086;
&#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1080;&#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1080;&#1084;&#1077;&#1085;&#1072; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;
&#171;.&#187; &#1080;&#1083;&#1080; &#171;..&#187;. &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; os.path.getsize() &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086;
&#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1080; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;,
&#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>file_sizes <span style="color: #666666">=</span> {name: os<span style="color: #666666">.</span>path<span style="color: #666666">.</span>getsize(name) <span style="color: #008000; font-weight: bold">for</span> name <span style="color: #AA22FF; font-weight: bold">in</span> os<span style="color: #666666">.</span>listdir(<span style="color: #BA2121">&quot;.&quot;</span>)
	      <span style="color: #008000; font-weight: bold">if</span> os<span style="color: #666666">.</span>path<span style="color: #666666">.</span>isfile(name)}
</pre></div>
<p>
&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>os.path.isfile()</code> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <code>os.path</code> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <code>True</code>, &#1077;&#1089;&#1083;&#1080;
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1080; <code>False</code> &#8211; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1090;&#1086;
&#1077;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;, &#1089;&#1089;&#1099;&#1083;&#1086;&#1082; &#1080; &#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1086;&#1075;&#1086;.

<p>
&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080;&#1085;&#1074;&#1077;&#1088;-
&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1091;&#1089;&#1090;&#1100; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; <code>d</code>, &#1090;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099;
&#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;, &#1082;&#1083;&#1102;&#1095;&#1072;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;
<code>d</code>, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#8211; &#1082;&#1083;&#1102;&#1095;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>d</code>:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>inverted_d <span style="color: #666666">=</span> {v: k <span style="color: #008000; font-weight: bold">for</span> k, v <span style="color: #AA22FF; font-weight: bold">in</span> d<span style="color: #666666">.</span>items()}
</pre></div>
<p>
&#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;
&#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#8211; &#1087;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1074;&#1089;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;
&#1087;&#1077;&#1088;&#1074;&#1086;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1073;&#1099;&#1083;&#1080; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1080;&#1085;&#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1090;&#1077;&#1088;&#1087;&#1077;&#1090;&#1100;
&#1085;&#1077;&#1091;&#1076;&#1072;&#1095;&#1091;, &#1089; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; <code>TypeError</code>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1083;&#1080;&#1073;&#1086;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077; &#1093;&#1077;&#1096;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1084;.

<h2 id="collections:maps:defaultdict" class="anchor">&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</h2>

<p>
&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#8211; &#1101;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080;, &#1086;&#1085;&#1080;
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1090;&#1077; &#1078;&#1077; &#1089;&#1072;&#1084;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099;, &#1095;&#1090;&#1086; &#1080; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1080;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1080; &#1086;&#1090; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1081;,
&#8211; &#1101;&#1090;&#1086; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;, &#1085;&#1086; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093;
&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103;&#1093; &#1086;&#1085;&#1080; &#1085;&#1080;&#1095;&#1077;&#1084; &#1085;&#1077; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1072;.

<p>
&#1055;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1085;&#1077;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; (&#171;&#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091;&#187;) &#1082;&#1083;&#1102;&#1095;&#1091; &#1089;&#1083;&#1086;&#1074;&#1072;-
&#1088;&#1103; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>KeyError</code>. &#1069;&#1090;&#1086; &#1086;&#1095;&#1077;&#1085;&#1100; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082;
&#1085;&#1077;&#1088;&#1077;&#1076;&#1082;&#1086; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1079;&#1085;&#1072;&#1090;&#1100; &#1086;&#1073; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1082;&#1083;&#1102;&#1095;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081;,
&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1085;&#1072;&#1096;&#1080;&#1084; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;. &#1053;&#1086; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093;
&#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1083;&#1080; &#1074;&#1089;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;, &#1076;&#1072;&#1078;&#1077; &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084;
&#1082;&#1083;&#1102;&#1095;&#1086;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082; &#1085;&#1077;&#1084;&#1091;.

<p>
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; <code>d</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;
&#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; m, &#1090;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>x = d[m]</code> &#1074;&#1086;&#1079;&#1073;&#1091;&#1076;&#1080;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;
<code>KeyError</code>. &#1045;&#1089;&#1083;&#1080; <code>d</code> &#8211; &#1101;&#1090;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;,
&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1084;, &#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; m &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090;
&#1090;&#1072;&#1082;&#1086;&#1084;&#1091; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1102;, &#1090;&#1086; &#1087;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1080; &#1082; &#1085;&#1077;&#1084;&#1091; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1086;
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077;&#1084;. &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1083;&#1102;&#1095; m, &#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;
&#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1089; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084; m &#1080; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1080; &#1073;&#1091;&#1076;&#1077;&#1090;
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1074;&#1085;&#1086;&#1074;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;.

<p>
<!-- Local Variables: -->
<!-- doconce-chapter-nickname: "collections" -->
<!-- doconce-section-nickname: "maps" -->
<!-- End: -->
<p>
<!-- navigation buttons at the bottom of the page -->
<ul class="pager">

  <li class="previous">
    <a href="._collections-flatly002.html">&larr; Prev</a>
  </li>

  <li class="next">
    <a href="._collections-flatly004.html">Next &rarr;</a>
  </li>
</ul>
<!-- ------------------- end of main content --------------- -->

</div>  <!-- end container -->
<!-- include javascript, jQuery *first* -->
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script>
<script src="https://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"></script>

<!-- Bootstrap footer
<footer>
<a href="http://..."><img width="250" align=right src="http://..."></a>
</footer>
-->


</body>
</html>
    

