<!--
Automatically generated HTML file from DocOnce source
(https://github.com/hplgit/doconce/)
-->
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="DocOnce: https://github.com/hplgit/doconce/" />
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
<meta name="description" content="Управляющие структуры и функции">

<title>Управляющие структуры и функции</title>

<!-- Bootstrap style: bootswatch_flatly -->
<link href="https://netdna.bootstrapcdn.com/bootswatch/3.1.1/flatly/bootstrap.min.css" rel="stylesheet">
<!-- not necessary
<link href="https://netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css" rel="stylesheet">
-->

<style type="text/css">
/* Let inline verbatim have the same color as the surroundings */
code { color: inherit; background-color: transparent; }

/* Add scrollbar to dropdown menus in bootstrap navigation bar */
.dropdown-menu {
   height: auto;
   max-height: 400px;
   overflow-x: hidden;
}

/* Adds an invisible element before each target to offset for the navigation
   bar */
.anchor::before {
  content:"";
  display:block;
  height:60px;      /* fixed header height for style bootswatch_flatly */
  margin:-60px 0 0; /* negative fixed header height */
}

body { font-size:20px; }
</style>


<!-- Tools for embedded Bokeh plots -->
<link rel=stylesheet 
      href=https://cdn.pydata.org/bokeh/release/bokeh-0.12.4.min.css 
      type=text/css />
<script type=text/javascript 
        src=https://cdn.pydata.org/bokeh/release/bokeh-0.12.4.min.js>
</script>
<script type=text/javascript>
  Bokeh.set_log_level("info");
</script>

<style>
.bk-embeded {
    width: 100%;
    margin: auto;
    height: 500px;
    text-align: webkit-left;
}
</style>


</head>


<!-- tocinfo
{'highest level': 1,
 'sections': [('Управляющие структуры',
               1,
               'control:ifcycle',
               'control:ifcycle'),
              ('Условное ветвление',
               2,
               'control:ifcycle:if',
               'control:ifcycle:if'),
              ('Циклы', 2, 'control:ifcycle:cycle', 'control:ifcycle:cycle'),
              ('Циклы `while`',
               3,
               'control:ifcycle:cycle:while',
               'control:ifcycle:cycle:while'),
              ('Циклы `for`',
               2,
               'control:ifcycle:cycle:for',
               'control:ifcycle:cycle:for'),
              ('Обработка исключений', 1, 'control:except', 'control:except'),
              ('Перехват и возбуждение исключений',
               2,
               'control:except:tryexept',
               'control:except:tryexept'),
              ('Возбуждение исключений',
               1,
               'control:except:tryexept:1',
               'control:except:tryexept:1'),
              ('Собственные функции', 1, 'control:funcs', 'control:funcs'),
              ('Распаковывание аргументов и параметров',
               2,
               'control:funcs:unpack',
               'control:funcs:unpack'),
              ('Доступ к переменным в глобальной области видимости',
               2,
               'control:funcs:global',
               'control:funcs:global'),
              ('Лямбда-функции',
               2,
               'control:funcs:lambda',
               'control:funcs:lambda'),
              ('Утверждения',
               1,
               'control:funcs:assert',
               'control:funcs:assert')]}
end of tocinfo -->

<body>

    
<!-- Bootstrap navigation bar -->
<div class="navbar navbar-default navbar-fixed-top">
  <div class="navbar-header">
    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-responsive-collapse">
      <span class="icon-bar"></span>
      <span class="icon-bar"></span>
      <span class="icon-bar"></span>
    </button>
    <a class="navbar-brand" href="control-flatly.html">Управляющие структуры и функции</a>
  </div>

  <div class="navbar-collapse collapse navbar-responsive-collapse">
    <ul class="nav navbar-nav navbar-right">
      <li class="dropdown">
        <a href="#" class="dropdown-toggle" data-toggle="dropdown">Contents <b class="caret"></b></a>
        <ul class="dropdown-menu">
     <!-- navigation toc: --> <li><a href="._control-flatly001.html#control:ifcycle" style="font-size: 80%;"><b>Управляющие структуры</b></a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly001.html#control:ifcycle:if" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Условное ветвление</a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly001.html#control:ifcycle:cycle" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Циклы</a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly001.html#control:ifcycle:cycle:while" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Циклы <code>while</code></a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly001.html#control:ifcycle:cycle:for" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Циклы <code>for</code></a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly002.html#control:except" style="font-size: 80%;"><b>Обработка исключений</b></a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly002.html#control:except:tryexept" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Перехват и возбуждение исключений</a></li>
     <!-- navigation toc: --> <li><a href="._control-flatly002.html#control:except:tryexept:1" style="font-size: 80%;"><b>Возбуждение исключений</b></a></li>
     <!-- navigation toc: --> <li><a href="#control:funcs" style="font-size: 80%;"><b>Собственные функции</b></a></li>
     <!-- navigation toc: --> <li><a href="#control:funcs:unpack" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Распаковывание аргументов и параметров</a></li>
     <!-- navigation toc: --> <li><a href="#control:funcs:global" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Доступ к переменным в глобальной области видимости</a></li>
     <!-- navigation toc: --> <li><a href="#control:funcs:lambda" style="font-size: 80%;">&nbsp;&nbsp;&nbsp;Лямбда-функции</a></li>
     <!-- navigation toc: --> <li><a href="#control:funcs:assert" style="font-size: 80%;"><b>Утверждения</b></a></li>

        </ul>
      </li>
    </ul>
  </div>
</div>
</div> <!-- end of navigation bar -->

<div class="container">

<p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p> <!-- add vertical space -->

<a name="part0003"></a>
<!-- !split -->

<h1 id="control:funcs" class="anchor">&#1057;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</h1>

<p>
&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;, &#1076;&#1072;&#1102;&#1097;&#1077;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;
&#1090;&#1080;&#1087;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;: &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;
&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;.

<p>
&#1042;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1083;&#1080; &#1076;&#1086; &#1089;&#1080;&#1093; &#1087;&#1086;&#1088;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; <em>&#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080;</em>
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;. &#1043;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; (&#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;) &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1080;&#1079; &#1083;&#1102;&#1073;&#1086;&#1081;
&#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; &#1090;&#1086;&#1084; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1084; &#1092;&#1072;&#1081;&#1083;&#1077;
<code>.py</code>), &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1087;&#1088;&#1080;&#1085;&#1072;&#1076;&#1083;&#1077;&#1078;&#1080;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1043;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;  &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1080; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077;&#1081;, &#1082;&#1072;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077;.

<p>
<em>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;</em> &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; (&#1080;&#1093; &#1077;&#1097;&#1077; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;) &#8211;
&#1101;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;. &#1069;&#1090;&#1080;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1077;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;, &#1075;&#1076;&#1077; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#8211; &#1086;&#1085;&#1080;
&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1093; &#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;,
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1080;&#1075;&#1076;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103;.

<p>
<em>&#1051;&#1103;&#1084;&#1073;&#1076;&#1072;</em>-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#8211; &#1101;&#1090;&#1086; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074; &#1084;&#1077;&#1089;&#1090;&#1077; &#1080;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;; &#1086;&#1085;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086;
&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1102; &#1089; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#8211; &#1101;&#1090;&#1086; &#1090;&#1077; &#1078;&#1077;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1090;&#1080;&#1087;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1084;&#1086;&#1075;&#1091;&#1090;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1074;&#1103;&#1079;&#1082;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084; &#1090;&#1080;&#1087;&#1086;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.

<p>
&#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; (&#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1083;&#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081;) &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081;
&#1074;&#1080;&#1076;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">functionName</span>(parameters):
    suite
</pre></div>
<p>
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; <code>parameters</code> &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1080; &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1073;&#1086;&#1083;&#1077;&#1077;
&#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074;
&#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102; &#1080;&#1083;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1072;&#1088; <code>identifier=value</code>, &#1086;
&#1095;&#1077;&#1084; &#1074;&#1089;&#1082;&#1086;&#1088;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1077;&#1077;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100; &#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1087;&#1086; &#1092;&#1086;&#1088;&#1084;&#1091;&#1083;&#1077; &#1043;&#1077;&#1088;&#1086;&#1085;&#1072;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">heron</span>(a, b, c):
    s <span style="color: #666666">=</span> (a <span style="color: #666666">+</span> b <span style="color: #666666">+</span> c) <span style="color: #666666">/</span> <span style="color: #666666">2</span>
    <span style="color: #008000; font-weight: bold">return</span> math<span style="color: #666666">.</span>sqrt(s <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> a) <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> b) <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> c))
</pre></div>
<p>
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, <code>a</code>, <code>b</code> &#1080; <code>c</code>, &#1080;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <code>heron(3, 4, 5)</code>.
&#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1072;&#1083;&#1086; &#1080;&#1083;&#1080; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1084;&#1085;&#1086;&#1075;&#1086; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1073;&#1091;&#1076;&#1077;&#1090;
&#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>TypeError</code>. &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103; &#1090;&#1072;&#1082;&#1086;&#1081; &#1074;&#1099;&#1079;&#1086;&#1074;, &#1084;&#1099; 
&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081;
&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>a</code>
&#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>3</code>, &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>b</code> &#8211; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>4</code> &#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>&#1089;</code> &#8211;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>5</code>.

<p>
&#1042;&#1089;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; Python &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1082;&#1072;&#1082;&#1086;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1093;&#1086;&#1090;&#1103;
&#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; (&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1090;&#1072;&#1082; &#1080; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103;) &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1080;&#1083;&#1080;
&#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1077;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1072; &#1089;&#1072;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1083;&#1083;&#1077;&#1082;&#1094;&#1080;&#1103;&#1084;&#1080;, 
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1085;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1085;&#1080;&#1082;&#1072;&#1082;&#1080;&#1093; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1081; &#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086;
&#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1086;&#1082;&#1080;&#1085;&#1091;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081;
&#1084;&#1086;&#1084;&#1077;&#1085;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; <code>return</code>. &#1045;&#1089;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; <code>return</code>
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; <code>return</code>, &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>None</code>.

<p>
&#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;-
&#1074;&#1072;&#1090;&#1100; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1088;&#1072;&#1079;&#1091;&#1084;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;-
&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1086;&#1076;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;-
&#1074;&#1086;&#1083;&#1086;&#1074; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;
&#1080;&#1079; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; ASCII:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">letter_count</span>(text, letters<span style="color: #666666">=</span>string<span style="color: #666666">.</span>ascii_letters):
    letters <span style="color: #666666">=</span> <span style="color: #008000">frozenset</span>(letters)
    count <span style="color: #666666">=</span> <span style="color: #666666">0</span>
    <span style="color: #008000; font-weight: bold">for</span> char <span style="color: #AA22FF; font-weight: bold">in</span> text:
        <span style="color: #008000; font-weight: bold">if</span> char <span style="color: #AA22FF; font-weight: bold">in</span> letters:
            count <span style="color: #666666">+=</span> <span style="color: #666666">1</span>
    <span style="color: #008000; font-weight: bold">return</span> count
</pre></div>
<p>
&#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;&#1072; <code>parameter=default</code> &#1073;&#1099;&#1083;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <code>letters</code>. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>letter_count()</code> &#1089; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
<code>letter_count(&quot;Maggie and Hopey&quot;)</code>. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>letter</code> &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1099;&#1083;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1072; &#1082;&#1072;&#1082;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1053;&#1086; &#1079;&#1072; &#1085;&#1072;&#1084;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1081;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;: <code>letter_count(&quot;Maggie and Hopey&quot;, &quot;aeiouAEIOU&quot;)</code>, &#1080;&#1083;&#1080;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; (&#1086;&#1073; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1093;
&#1088;&#1072;&#1089;&#1089;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1080;&#1078;&#1077;): <code>letter_count(&quot;Maggie and Hopey&quot;, letters=&quot;aeiouAEIOU&quot;)</code>.

<p>
&#1057;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;,
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1090;&#1072;&#1082;&#1086;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;: <code>def bad(a, b=1, c):</code>, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;
&#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1095;&#1077;&#1089;&#1082;&#1091;&#1102; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;. &#1057; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1084;&#1099; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074; &#1090;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1074; &#1082;&#1072;&#1082;&#1086;&#1084; &#1086;&#1085;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#8211;
&#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077;
<code>name=value</code>.

<h2 id="control:funcs:unpack" class="anchor">&#1056;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</h2>

<p>
&#1042; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1081; &#1075;&#1083;&#1072;&#1074;&#1077; &#1084;&#1099; &#1074;&#1080;&#1076;&#1077;&#1083;&#1080;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081;
(<code>*</code>). &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1080;&#1090;&#1100; &#1087;&#1083;&#1086;&#1097;&#1072;&#1076;&#1100;
&#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072;, &#1072; &#1076;&#1083;&#1080;&#1085;&#1099; &#1074;&#1089;&#1077;&#1093; &#1077;&#1075;&#1086; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;, &#1090;&#1086; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080;
&#1073;&#1099; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; &#1090;&#1072;&#1082;: <code>heron(sides[0], sides[1], sides[2])</code>, &#1080;&#1083;&#1080;
&#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1074;&#1099;&#1079;&#1086;&#1074; &#1085;&#1072;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1097;&#1077;:
<code>heron(*sides)</code>. &#1045;&#1089;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; (&#1080;&#1083;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081;
&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;) &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;, &#1095;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084;
&#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1088;&#1077;&#1079;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1085;&#1091;&#1078;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.

<p>
&#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;
&#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>product()</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; 
&#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1080;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">product</span>(<span style="color: #666666">*</span>args):
    result <span style="color: #666666">=</span> <span style="color: #666666">1</span>
    <span style="color: #008000; font-weight: bold">for</span> arg <span style="color: #AA22FF; font-weight: bold">in</span> args:
        result <span style="color: #666666">*=</span> arg
    <span style="color: #008000; font-weight: bold">return</span> result
</pre></div>
<p>
&#1069;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <code>args</code>. &#1053;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077;
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; <code>*</code> &#1087;&#1077;&#1088;&#1077;&#1076; &#1085;&#1080;&#1084; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <code>args</code>
&#1086;&#1073;&#1088;&#1077;&#1090;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1072;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>product(<span style="color: #666666">1</span>, <span style="color: #666666">2</span>, <span style="color: #666666">3</span>, <span style="color: #666666">4</span>) <span style="color: #408080; font-style: italic"># args == (1, 2, 3, 4); вернет: 24</span>
product(<span style="color: #666666">5</span>, <span style="color: #666666">3</span>, <span style="color: #666666">8</span>)    <span style="color: #408080; font-style: italic"># args == (5, 3, 8); вернет: 120</span>
product(<span style="color: #666666">11</span>)   	    <span style="color: #408080; font-style: italic"># args == (11,); вернет: 11</span>
</pre></div>
<p>
&#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1074;&#1089;&#1083;&#1077;&#1076; &#1079;&#1072; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1082;&#1072;&#1082;
&#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1080;&#1078;&#1077;, &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1097;&#1077;&#1081; &#1089;&#1091;&#1084;&#1084;&#1091; &#1089;&#1074;&#1086;&#1080;&#1093;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1086;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">sum_of_powers</span>(<span style="color: #666666">*</span>args, power<span style="color: #666666">=1</span>):
    result <span style="color: #666666">=</span> <span style="color: #666666">0</span>
    <span style="color: #008000; font-weight: bold">for</span> arg <span style="color: #AA22FF; font-weight: bold">in</span> args:
        result <span style="color: #666666">+=</span> arg <span style="color: #666666">**</span> power
    <span style="color: #008000; font-weight: bold">return</span> result
</pre></div>
<p>
&#1069;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;,
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <code>sum_of_powers(1, 3, 5)</code>, &#1080;&#1083;&#1080; &#1082;&#1072;&#1082; &#1089; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1089;
&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <code>sum_of_powers(1, 3, 5, power=2)</code>.

<p>
&#1044;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <code>*</code> &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
&#171;&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#187;. &#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1086;&#1085; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; <code>*</code> &#1085;&#1077;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>heron()</code>. &#1053;&#1072; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1090;&#1086;&#1095;&#1085;&#1086; &#1090;&#1088;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080; &#1086;&#1076;&#1080;&#1085; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;.
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">heron2</span>(a, b, c, <span style="color: #666666">*</span>, units<span style="color: #666666">=</span><span style="color: #BA2121">&quot;meters&quot;</span>):
    s <span style="color: #666666">=</span> (a <span style="color: #666666">+</span> b <span style="color: #666666">+</span> c) <span style="color: #666666">/</span> <span style="color: #666666">2</span>
    area <span style="color: #666666">=</span> math<span style="color: #666666">.</span>sqrt(s <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> a) <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> b) <span style="color: #666666">*</span> (s <span style="color: #666666">-</span> c))
    <span style="color: #008000; font-weight: bold">return</span> <span style="color: #BA2121">&quot;</span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> </span><span style="color: #BB6688; font-weight: bold">{1}</span><span style="color: #BA2121">&quot;</span><span style="color: #666666">.</span>format(area, units)
</pre></div>
<p>
&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1074; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>heron2(<span style="color: #666666">25</span>, <span style="color: #666666">24</span>, <span style="color: #666666">7</span>)		  <span style="color: #408080; font-style: italic"># вернет: &#39;84.0 meters&#39;</span>
heron2(<span style="color: #666666">41</span>, <span style="color: #666666">9</span>, <span style="color: #666666">40</span>, units<span style="color: #666666">=</span><span style="color: #BA2121">&quot;inches&quot;</span>) <span style="color: #408080; font-style: italic"># вернет: &#39;180.0 inches&#39;</span>
heron2(<span style="color: #666666">25</span>, <span style="color: #666666">24</span>, <span style="color: #666666">7</span>, <span style="color: #BA2121">&quot;inches&quot;</span>)	  <span style="color: #408080; font-style: italic"># ОШИБКА! Возбудит исключение TypeError</span>
</pre></div>
<p>
&#1042; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1084; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1099; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1083;&#1080;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;,
&#1085;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; <code>*</code> &#1085;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>TypeError</code>.

<p>
&#1055;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1074; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; <code>*</code> &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1084;&#1099; &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084;
&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1087;&#1088;&#1077;&#1090;&#1080;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1083;&#1102;&#1073;&#1099;&#1093; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;
&#1074;&#1099;&#1085;&#1091;&#1076;&#1080;&#1084; &#1090;&#1077;&#1093;, &#1082;&#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1080;&#1075;&#1085;&#1072;&#1090;&#1091;&#1088;&#1099; &#1090;&#1072;&#1082;&#1086;&#1081; (&#1074;&#1099;&#1084;&#1099;&#1096;&#1083;&#1077;&#1085;&#1085;&#1086;&#1081;)
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;: 
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">print_setup</span>(<span style="color: #666666">*</span>, paper<span style="color: #666666">=</span><span style="color: #BA2121">&quot;Letter&quot;</span>, copies<span style="color: #666666">=1</span>, color<span style="color: #666666">=</span><span style="color: #008000; font-weight: bold">False</span>):
</pre></div>
<p>
&#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>print_setup()</code> &#1073;&#1077;&#1079; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1103;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1048;&#1083;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1080;&#1083;&#1080;
&#1074;&#1089;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
<code>print_setup(paper=&quot;A4&quot;, color=True)</code>. &#1053;&#1086; &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1084;&#1089;&#1103;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <code>print_setup(&quot;A4&quot;)</code>,
&#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1086; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>TypeError</code>.

<p>
&#1058;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1084;&#1099; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#8211;
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; (<code>**</code>). &#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; <code>**</code>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; &#1074;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>print_setup()</code>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: 
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>options <span style="color: #666666">=</span> <span style="color: #008000">dict</span>(paper<span style="color: #666666">=</span><span style="color: #BA2121">&quot;A4&quot;</span>, color<span style="color: #666666">=</span><span style="color: #008000; font-weight: bold">True</span>)
print_setup(<span style="color: #666666">**</span>options)
</pre></div>
<p>
&#1042; &#1076;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1072;&#1088;&#1099; &#171;&#1082;&#1083;&#1102;&#1095;-&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#187; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103; <code>options</code> &#1073;&#1091;&#1076;&#1091;&#1090;
&#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1072;&#1085;&#1099;, &#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1072;&#1089;&#1089;&#1086;&#1094;&#1080;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;, &#1095;&#1100;&#1077; 
&#1080;&#1084;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1083;&#1102;&#1095;&#1091; &#1101;&#1090;&#1086;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1090;&#1089;&#1103;
&#1082;&#1083;&#1102;&#1095;, &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1085;&#1080; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1086;
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>TypeError</code>. &#1051;&#1102;&#1073;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1077; &#1085;&#1077;
&#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1085;&#1086;
&#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1080;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1077;&#1085;&#1086;
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>TypeError</code>.

<p>
&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1089;&#1087;&#1072;&#1082;&#1086;&#1074;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;
&#1074;&#1084;&#1077;&#1089;&#1090;&#1077; &#1089; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084;&#1080; &#1074; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1083;&#1102;&#1073;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1053;&#1080;&#1078;&#1077;
&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; <code>add_person_details()</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088;
&#1082;&#1072;&#1088;&#1090;&#1086;&#1095;&#1082;&#1080; &#1089;&#1086;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1089;&#1090;&#1088;&#1072;&#1093;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1092;&#1072;&#1084;&#1080;&#1083;&#1080;&#1102; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">add_person_details</span>(ssn, surname, <span style="color: #666666">**</span>kwargs):
    <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot;SSN =&quot;</span>, ssn)
    <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot; surname =&quot;</span>, surname)
    <span style="color: #008000; font-weight: bold">for</span> key <span style="color: #AA22FF; font-weight: bold">in</span> <span style="color: #008000">sorted</span>(kwargs):
        <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot; </span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> = </span><span style="color: #BB6688; font-weight: bold">{1}</span><span style="color: #BA2121">&quot;</span><span style="color: #666666">.</span>format(key, kwargs[key]))
</pre></div>
<p>
&#1069;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1076;&#1074;&#1091;&#1084;&#1103; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1084;&#1080;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;, &#1090;&#1072;&#1082; &#1080; &#1089; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
<code>add_person_details(83272171, &quot;Luther&quot;, forename=&quot;Lexis&quot;, age=47)</code>.
&#1058;&#1072;&#1082;&#1072;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1075;&#1088;&#1086;&#1084;&#1085;&#1091;&#1102; &#1075;&#1080;&#1073;&#1082;&#1086;&#1089;&#1090;&#1100;. &#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084;
&#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">print_args</span>(<span style="color: #666666">*</span>args, <span style="color: #666666">**</span>kwargs):
    <span style="color: #008000; font-weight: bold">for</span> i, arg <span style="color: #AA22FF; font-weight: bold">in</span> <span style="color: #008000">enumerate</span>(args):
    <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot;positional argument </span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> = </span><span style="color: #BB6688; font-weight: bold">{1}</span><span style="color: #BA2121">&quot;</span><span style="color: #666666">.</span>format(i, arg))
    <span style="color: #008000; font-weight: bold">for</span> key <span style="color: #AA22FF; font-weight: bold">in</span> kwargs:
        <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot;keyword argument </span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> = </span><span style="color: #BB6688; font-weight: bold">{1}</span><span style="color: #BA2121">&quot;</span><span style="color: #666666">.</span>format(key, kwargs[key]))
</pre></div>
<p>
&#1069;&#1090;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;. &#1054;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;
&#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1073;&#1077;&#1079; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1089; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1080;
&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;.

<h2 id="control:funcs:global" class="anchor">&#1044;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;</h2>

<p>
&#1048;&#1085;&#1086;&#1075;&#1076;&#1072; &#1073;&#1099;&#1074;&#1072;&#1077;&#1090; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093;
&#1080;&#1079; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1087;&#1083;&#1086;&#1093;&#1086;&#1075;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1088;&#1077;&#1095;&#1100; &#1080;&#1076;&#1077;&#1090;
&#1086; &#171;&#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;&#1072;&#1093;&#187;, &#1085;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#8211; &#1101;&#1090;&#1086; &#1085;&#1077; &#1089;&#1072;&#1084;&#1099;&#1081; &#1083;&#1091;&#1095;&#1096;&#1080;&#1081; &#1074;&#1099;&#1093;&#1086;&#1076;,
&#1093;&#1086;&#1090;&#1103; &#1076;&#1083;&#1103; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1093; &#1086;&#1076;&#1085;&#1086;&#1088;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084; &#1101;&#1090;&#1086; &#1074; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086;
&#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;.

<p>
&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <a href="src-control/digit_names.py" target="_self">digit_names.py</a> &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;
&#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1103;&#1079;&#1099;&#1082;&#1072; (<code>en</code> &#1080;&#1083;&#1080; <code>ru</code>) &#1080; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;
&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1094;&#1080;&#1092;&#1088; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100;
&#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1073;&#1099;&#1083;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1095;&#1080;&#1089;&#1083;&#1086; <code>123</code>, &#1086;&#1085;&#1072;
&#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; <code>one two three</code>. &#1042; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1090;&#1088;&#1080; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>Language <span style="color: #666666">=</span> <span style="color: #BA2121">&quot;en&quot;</span>

ENGLISH <span style="color: #666666">=</span> {<span style="color: #666666">0</span>: <span style="color: #BA2121">&quot;zero&quot;</span>, <span style="color: #666666">1</span>: <span style="color: #BA2121">&quot;one&quot;</span>, <span style="color: #666666">2</span>: <span style="color: #BA2121">&quot;two&quot;</span>, <span style="color: #666666">3</span>: <span style="color: #BA2121">&quot;three&quot;</span>, <span style="color: #666666">4</span>: <span style="color: #BA2121">&quot;four&quot;</span>,
           <span style="color: #666666">5</span>: <span style="color: #BA2121">&quot;five&quot;</span>, <span style="color: #666666">6</span>: <span style="color: #BA2121">&quot;six&quot;</span>, <span style="color: #666666">7</span>: <span style="color: #BA2121">&quot;seven&quot;</span>, <span style="color: #666666">8</span>: <span style="color: #BA2121">&quot;eight&quot;</span>, <span style="color: #666666">9</span>: <span style="color: #BA2121">&quot;nine&quot;</span>}
RUSSIAN <span style="color: #666666">=</span> {<span style="color: #666666">0</span>: <span style="color: #BA2121">&quot;ноль&quot;</span>, <span style="color: #666666">1</span>: <span style="color: #BA2121">&quot;один&quot;</span>, <span style="color: #666666">2</span>: <span style="color: #BA2121">&quot;два&quot;</span>, <span style="color: #666666">3</span>: <span style="color: #BA2121">&quot;три&quot;</span>, <span style="color: #666666">4</span>: <span style="color: #BA2121">&quot;четыре&quot;</span>,
           <span style="color: #666666">5</span>: <span style="color: #BA2121">&quot;пять&quot;</span>, <span style="color: #666666">6</span>: <span style="color: #BA2121">&quot;шесть&quot;</span>, <span style="color: #666666">7</span>: <span style="color: #BA2121">&quot;семь&quot;</span>, <span style="color: #666666">8</span>: <span style="color: #BA2121">&quot;восемь&quot;</span>, <span style="color: #666666">9</span>: <span style="color: #BA2121">&quot;девять&quot;</span>}
</pre></div>
<p>
&#1052;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1084; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1102;, &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;,
&#1080;&#1075;&#1088;&#1072;&#1102;&#1097;&#1080;&#1093; &#1088;&#1086;&#1083;&#1100; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;, &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1084;&#1080; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086;
&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;, &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1083;&#1080; &#1072;&#1085;&#1075;&#1083;&#1080;&#1081;&#1089;&#1082;&#1080;&#1081; &#1103;&#1079;&#1099;&#1082; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.

<p>
&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;
<code>Language</code>, &#1080; &#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086;
&#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1103;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">print_digits</span>(digits):
    dictionary <span style="color: #666666">=</span> ENGLISH <span style="color: #008000; font-weight: bold">if</span> Language <span style="color: #666666">==</span> <span style="color: #BA2121">&quot;en&quot;</span> <span style="color: #008000; font-weight: bold">else</span> RUSSIAN
    <span style="color: #008000; font-weight: bold">for</span> digit <span style="color: #AA22FF; font-weight: bold">in</span> digits:
        <span style="color: #008000">print</span>(dictionary[<span style="color: #008000">int</span>(digit)], end<span style="color: #666666">=</span><span style="color: #BA2121">&quot; &quot;</span>)
    <span style="color: #008000">print</span>()
</pre></div>
<p>
&#1050;&#1086;&#1075;&#1076;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; Python &#1074;&#1089;&#1090;&#1088;&#1077;&#1095;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <code>Language</code> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1086;&#1085; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1099;&#1089;&#1082;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1074;
&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;) &#1080; &#1085;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1086;&#1085; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1072;&#1077;&#1090; &#1087;&#1086;&#1080;&#1089;&#1082; &#1074;
&#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; <code>.py</code>), &#1075;&#1076;&#1077; &#1080;
&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1077;&#1075;&#1086;.

<p>
&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>main()</code> &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1054;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <code>Language</code> &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; 
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>print_digits()</code> &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;.

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">def</span> <span style="color: #0000FF">main</span>():
    <span style="color: #008000; font-weight: bold">if</span> <span style="color: #008000">len</span>(sys<span style="color: #666666">.</span>argv) <span style="color: #666666">==</span> <span style="color: #666666">1</span> <span style="color: #AA22FF; font-weight: bold">or</span> sys<span style="color: #666666">.</span>argv[<span style="color: #666666">1</span>] <span style="color: #AA22FF; font-weight: bold">in</span> {<span style="color: #BA2121">&quot;-h&quot;</span>, <span style="color: #BA2121">&quot;--help&quot;</span>}:
        <span style="color: #008000">print</span>(<span style="color: #BA2121">&quot;usage: </span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> [en|ru] number&quot;</span><span style="color: #666666">.</span>format(sys<span style="color: #666666">.</span>argv[<span style="color: #666666">0</span>]))
        sys<span style="color: #666666">.</span>exit()

    args <span style="color: #666666">=</span> sys<span style="color: #666666">.</span>argv[<span style="color: #666666">1</span>:]
    <span style="color: #008000; font-weight: bold">if</span> args[<span style="color: #666666">0</span>] <span style="color: #AA22FF; font-weight: bold">in</span> {<span style="color: #BA2121">&quot;en&quot;</span>, <span style="color: #BA2121">&quot;ru&quot;</span>}:
        <span style="color: #008000; font-weight: bold">global</span> Language
        Language <span style="color: #666666">=</span> args<span style="color: #666666">.</span>pop(<span style="color: #666666">0</span>)
    print_digits(args<span style="color: #666666">.</span>pop(<span style="color: #666666">0</span>))
</pre></div>
<p>
&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <code>global</code> &#1074; &#1101;&#1090;&#1086;&#1081;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1069;&#1090;&#1072; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100;
&#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088;&#1091;, &#1095;&#1090;&#1086; &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1074; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; 
&#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; <code>.py</code>) &#1080; &#1095;&#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;
&#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1082; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081;; &#1073;&#1077;&#1079; &#1101;&#1090;&#1086;&#1081;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089; &#1090;&#1077;&#1084; &#1078;&#1077;
&#1080;&#1084;&#1077;&#1085;&#1077;&#1084;.

<p>
<div class="panel panel-primary">
  <div class="panel-heading">
  <h3 class="panel-title">Замечание</h3>
  </div>
<div class="panel-body">
<p> <!-- subsequent paragraphs come in larger fonts, so start with a paragraph -->
&#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; <code>global</code>, &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;
&#1089;&#1074;&#1086;&#1102; &#1088;&#1072;&#1073;&#1086;&#1090;&#1086;&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1085;&#1086;&#1089;&#1090;&#1100;, &#1085;&#1086; &#1082;&#1086;&#1075;&#1076;&#1072; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; &#1074;&#1089;&#1090;&#1088;&#1077;&#1090;&#1080;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102;
<code>Language</code> &#1074; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <code>if</code>, &#1086;&#1085; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1099;&#1089;&#1082;&#1072;&#1090;&#1100; &#1077;&#1077; &#1074;
&#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; (&#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;) &#1080;, &#1085;&#1077;
&#1086;&#1073;&#1085;&#1072;&#1088;&#1091;&#1078;&#1080;&#1074; &#1077;&#1077;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1089;&#1090; &#1085;&#1086;&#1074;&#1091;&#1102; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; <code>Language</code>,
&#1086;&#1089;&#1090;&#1072;&#1074;&#1080;&#1074; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; <code>Language</code> &#1073;&#1077;&#1079; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;. &#1069;&#1090;&#1072;
&#1084;&#1072;&#1083;&#1086;&#1079;&#1072;&#1084;&#1077;&#1090;&#1085;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;
&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1089; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; <code>ru</code>, &#1087;&#1086;&#1090;&#1086;&#1084;&#1091; &#1095;&#1090;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072;
&#1085;&#1086;&#1074;&#1072;&#1103; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; <code>Language</code>, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>ru</code>, &#1072; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; <code>Language</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; <code>print_digits()</code>, &#1087;&#1086;-&#1087;&#1088;&#1077;&#1078;&#1085;&#1077;&#1084;&#1091; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>en</code>.
</div>
</div>


<p>
&#1042; &#1089;&#1083;&#1086;&#1078;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1083;&#1091;&#1095;&#1096;&#1077; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1079;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1072;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1102;&#1090; &#1091;&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1083;&#1077;&#1085;&#1080;&#1103;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <code>global</code>.

<h2 id="control:funcs:lambda" class="anchor">&#1051;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;</h2>

<p>
&#1051;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#8211; &#1101;&#1090;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">lambda</span> parameters: expression
</pre></div>
<p>
&#1063;&#1072;&#1089;&#1090;&#1100; <code>parameters</code> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1072;
&#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1084;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1072;&#1087;&#1103;&#1090;&#1099;&#1084;&#1080;, &#1090;&#1086;
&#1077;&#1089;&#1090;&#1100; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1093;&#1086;&#1090;&#1103; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;
&#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;-
&#1085;&#1080;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1074; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <code>def</code>. &#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
<code>expression</code> &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1093; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1081; &#1080;&#1083;&#1080; &#1094;&#1080;&#1082;&#1083;&#1086;&#1074; (&#1093;&#1086;&#1090;&#1103;
&#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1099;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;&#1080;), &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; <code>return</code> (&#1080;&#1083;&#1080; <code>yield</code>). &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1072;&#1103; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;. &#1050;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1086;&#1085;&#1072;
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; <code>expression</code>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
expression &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;, &#1086;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086; &#1074;
&#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080;.

<p>
&#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; (&#1080;&#1083;&#1080;
&#1085;&#1077; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;) &#1089;&#1091;&#1092;&#1092;&#1080;&#1082;&#1089; <code>s</code> &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1083;&#1080; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1: 
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>s <span style="color: #666666">=</span> <span style="color: #008000; font-weight: bold">lambda</span> x: <span style="color: #BA2121">&quot;&quot;</span> <span style="color: #008000; font-weight: bold">if</span> x <span style="color: #666666">==</span> <span style="color: #666666">1</span> <span style="color: #008000; font-weight: bold">else</span> <span style="color: #BA2121">&quot;s&quot;</span>
</pre></div>
<p>
&#1051;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1072;&#1085;&#1086;&#1085;&#1080;&#1084;&#1085;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;
&#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <code>s</code>. &#1051;&#1102;&#1073;&#1072;&#1103; (&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103;) &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1082;&#1088;&#1091;&#1075;&#1083;&#1099;&#1093; &#1089;&#1082;&#1086;&#1073;&#1086;&#1082;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080; &#1087;&#1086;&#1084;&#1086;&#1097;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>s()</code> &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1077; &#1089; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;
&#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000">print</span>(<span style="color: #BA2121">&quot;</span><span style="color: #BB6688; font-weight: bold">{0}</span><span style="color: #BA2121"> file</span><span style="color: #BB6688; font-weight: bold">{1}</span><span style="color: #BA2121"> processed&quot;</span><span style="color: #666666">.</span>format(count, s(count)))
</pre></div>
<p>
&#1051;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; <code>key</code> &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1081;
&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <code>sorted()</code> &#1080;&#1083;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <code>list.sort()</code>. &#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1090;&#1088;&#1077;&#1093;&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1080; (&#1085;&#1086;&#1084;&#1077;&#1088;
&#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;), &#1080; &#1085;&#1072;&#1084; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1090;&#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1101;&#1090;&#1086;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086;
&#1089;&#1087;&#1080;&#1089;&#1082;&#1072;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>elements <span style="color: #666666">=</span> [(<span style="color: #666666">2</span>, <span style="color: #666666">12</span>, <span style="color: #BA2121">&quot;Mg&quot;</span>), (<span style="color: #666666">1</span>, <span style="color: #666666">11</span>, <span style="color: #BA2121">&quot;Na&quot;</span>), (<span style="color: #666666">1</span>, <span style="color: #666666">3</span>, <span style="color: #BA2121">&quot;Li&quot;</span>), (<span style="color: #666666">2</span>, <span style="color: #666666">4</span>, <span style="color: #BA2121">&quot;Be&quot;</span>)]
</pre></div>
<p>
&#1054;&#1090;&#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>[(<span style="color: #666666">1</span>, <span style="color: #666666">3</span>, <span style="color: #BA2121">&#39;Li&#39;</span>), (<span style="color: #666666">1</span>, <span style="color: #666666">11</span>, <span style="color: #BA2121">&#39;Na&#39;</span>), (<span style="color: #666666">2</span>, <span style="color: #666666">4</span>, <span style="color: #BA2121">&#39;Be&#39;</span>), (<span style="color: #666666">2</span>, <span style="color: #666666">12</span>, <span style="color: #BA2121">&#39;Mg&#39;</span>)]
</pre></div>
<p>
&#1056;&#1072;&#1085;&#1077;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>sorted()</code>, &#1090;&#1086; &#1074;&#1080;&#1076;&#1077;&#1083;&#1080;, &#1095;&#1090;&#1086;
&#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; <code>key</code>
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1084;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1090;&#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1077; &#1087;&#1086; &#1077;&#1089;&#1090;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1091;: &#1085;&#1086;&#1084;&#1077;&#1088; &#1075;&#1088;&#1091;&#1087;&#1087;&#1099;, &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1080;
&#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1072; &#1087;&#1086; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1086;&#1084;&#1091; &#1085;&#1086;&#1084;&#1077;&#1088;&#1091; &#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102;, &#1090;&#1086; &#1084;&#1099; &#1084;&#1086;&#1075;&#1083;&#1080; &#1073;&#1099; &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100;
&#1084;&#1072;&#1083;&#1077;&#1085;&#1100;&#1082;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <code>def ignore0(e): return e[1], e[2]</code> &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1077;&#1077;
&#1074; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077; <code>key</code>. &#1053;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; &#1084;&#1072;&#1089;&#1089;&#1091; &#1082;&#1088;&#1086;&#1096;&#1077;&#1095;&#1085;&#1099;&#1093; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;,
&#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1093; &#1101;&#1090;&#1086;&#1081;, &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1077;&#1091;&#1076;&#1086;&#1073;&#1085;&#1086;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;
&#1072;&#1083;&#1100;&#1090;&#1077;&#1088;&#1085;&#1072;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1081;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>elements<span style="color: #666666">.</span>sort(key<span style="color: #666666">=</span><span style="color: #008000; font-weight: bold">lambda</span> e: (e[<span style="color: #666666">1</span>], e[<span style="color: #666666">2</span>]))
</pre></div>
<p>
&#1047;&#1076;&#1077;&#1089;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; key &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;
<code>lambda e: (e[1], e[2])</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1074; &#1074;&#1080;&#1076;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; e &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1089;&#1077; &#1090;&#1088;&#1077;&#1093;&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1085;&#1099;&#1077; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1080; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;. &#1050;&#1088;&#1091;&#1075;&#1083;&#1099;&#1077; &#1089;&#1082;&#1086;&#1073;&#1082;&#1080;,
&#1086;&#1082;&#1088;&#1091;&#1078;&#1072;&#1102;&#1097;&#1080;&#1077; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;
&#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1077;&#1084; &#1080; &#1083;&#1103;&#1084;&#1073;&#1076;&#1072;-&#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;. &#1044;&#1083;&#1103;
&#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1073;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102;
&#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1088;&#1077;&#1079;&#1072;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>elements<span style="color: #666666">.</span>sort(key<span style="color: #666666">=</span><span style="color: #008000; font-weight: bold">lambda</span> e: e[<span style="color: #666666">1</span>:<span style="color: #666666">3</span>])
</pre></div>
<p>
&#1053;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1083;&#1086;&#1078;&#1085;&#1072;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;
&#1087;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1102;, &#1073;&#1077;&#1079; &#1091;&#1095;&#1077;&#1090;&#1072; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;, &#1080; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1086;&#1084;&#1091; &#1085;&#1086;&#1084;&#1077;&#1088;&#1091;:

<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span>elements<span style="color: #666666">.</span>sort(key<span style="color: #666666">=</span><span style="color: #008000; font-weight: bold">lambda</span> e: (e[<span style="color: #666666">2</span>]<span style="color: #666666">.</span>lower(), e[<span style="color: #666666">1</span>]))
</pre></div>

<h1 id="control:funcs:assert" class="anchor">&#1059;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103;</h1>

<p>
&#1063;&#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1077;&#1090;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1099;&#1077;
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;? &#1063;&#1090;&#1086; &#1089;&#1083;&#1091;&#1095;&#1080;&#1090;&#1089;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1085;&#1077;&#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;? &#1057;&#1072;&#1084;&#1086;&#1077; &#1085;&#1077;&#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086;&#1077;, &#1095;&#1090;&#1086;
&#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1090;&#1080;, &#8211; &#1101;&#1090;&#1086; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1073;&#1077;&#1079;
&#1082;&#1072;&#1082;&#1080;&#1093;-&#1083;&#1080;&#1073;&#1086; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;, &#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1099;. &#1054;&#1076;&#1080;&#1085;
&#1080;&#1079; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1086;&#1074; &#1080;&#1079;&#1073;&#1077;&#1078;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1086;&#1074;&#1072;&#1088;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099;
&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1090;&#1077;&#1089;&#1090;&#1099;. &#1044;&#1088;&#1091;&#1075;&#1086;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1089;&#1086;&#1089;&#1090;&#1086;&#1080;&#1090; &#1074; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;
&#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1099;&#1081; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1090;&#1100; &#1086;&#1073;
&#1086;&#1096;&#1080;&#1073;&#1082;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1080; &#1085;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1076;&#1088;&#1091;&#1075; &#1076;&#1088;&#1091;&#1075;&#1091;. &#1042; &#1080;&#1076;&#1077;&#1072;&#1083;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;
&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1090;&#1072;&#1082; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103;
&#1087;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1081; &#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1099;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;.

<p>
&#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1084;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <code>assert</code>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1089;&#1080;&#1085;&#1090;&#1072;&#1082;&#1089;&#1080;&#1089;:
<p>

<!-- code=python (!bc pycod) typeset with pygments style "default" -->
<div class="highlight" style="background: #f8f8f8"><pre style="line-height: 125%"><span></span><span style="color: #008000; font-weight: bold">assert</span> boolean_expression, optional_expression
</pre></div>
<p>
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>boolean_expression</code> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <code>False</code>,
&#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <code>AssertionError</code>. &#1045;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1086; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077;
&#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; <code>optional_expression</code>, &#1086;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1086; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;
&#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; <code>AssertionError</code>, &#1095;&#1090;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081;
&#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1091;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; 
&#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080;, &#1072; &#1085;&#1077; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1084;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084;&#1080;.
&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1097;&#1080;&#1077; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1101;&#1082;&#1089;&#1087;&#1083;&#1091;&#1072;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;,
&#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1080;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1099;&#1077; &#1072;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081;
&#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;,
&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1086;&#1084; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1086;&#1073; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;&#1093; &#1080;&#1083;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1081; &#1074; &#1092;&#1072;&#1081;&#1083;
&#1078;&#1091;&#1088;&#1085;&#1072;&#1083;&#1072;.

<p>
<!-- Local Variables: -->
<!-- doconce-chapter-nickname: "control" -->
<!-- doconce-section-nickname: "funcs" -->
<!-- End: -->
<p>
<!-- navigation buttons at the bottom of the page -->
<ul class="pager">

  <li class="previous">
    <a href="._control-flatly002.html">&larr; Prev</a>
  </li>

  <li class="next">
    <a href="._control-flatly004.html">Next &rarr;</a>
  </li>
</ul>
<!-- ------------------- end of main content --------------- -->

</div>  <!-- end container -->
<!-- include javascript, jQuery *first* -->
<script src="https://ajax.googleapis.com/ajax/libs/jquery/1.10.2/jquery.min.js"></script>
<script src="https://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"></script>

<!-- Bootstrap footer
<footer>
<a href="http://..."><img width="250" align=right src="http://..."></a>
</footer>
-->


</body>
</html>
    

