# -*- coding: utf-8 -*-

# --- Start snippet 1 ---
# Заданные сетки как массивы x и t
dx = x[1] - x[0]
dt = t[1] - t[0]
C = c*dt/dx  # Число Куранта
K = len(t) - 1
N = len(x) - 1
C2 = C**2

# Задаем начальное условие
for i in range(N+1) :
	y_1[i] = I(x[i])

# Используем специальную формулу для расчета на первом
# временном шаге с учетом du/dt = 0
for i in range(N):
    y[i] = y_1[i] - 0.5*C2(y_1[i+1] - 2*y_1[i] + y_1[i-1])
y[0] = 0; y[N] = 0 # Применяем граничные условия

# Изменяем переменные перед переходом на следующий
# временной слой
y_2[:], y_1[:] = y_1, y

for n in range(K) :
	# Пересчитываем значения во внутренних узлах сетки на слое n+1
	for i in range(1, N) :
		y[i] = 2*y_1[i] - y_2[i] - C2*(y_1[i+1] - 2*y_1[i] + y_1[i-1])
    # Задаем граничные условия
    y[0] = 0; y[N] = 0
    # Изменяем переменные перед переходом на следующий
    # временной слой
    y_2[:], y_1[:] = y_1, y
# --- End snippet 1 ---

# --- Start snippet 2 ---
i = 0
ip1 = i+1
im1 = ip1  # i-1 -> i+1
y[i] = y_1[i] + gamma2*(y_1[im1] - 2*y[i] + y_1[ip1])

i = N
im1 = i-1
ip1 = im1  # i+1 -> i-1
y[i] = y_1[i] + gamma2*(y_1[im1] - 2*y[i] + y_1[ip1])
# --- End snippet 2 ---

# --- Start snippet 3 ---
for i in range(0, N+1):
	ip1 = i+1 if i < N+1 else i-1
	im1 = i-1 if i > 0 else i+1
	y[i] = y_1[i] + gamma2*(y_1[im1] - 2*y[i] + y_1[ip1])
# --- End snippet 3 ---

# --- Start snippet 4 ---
# Начальные условия
for i in Ix[1:-1]:
	y[i] = y_1[i] - 0.5*gamma2*(y_1[i+1] - 2*y_1[i] + y_1[i-1])

# Цикл по времени
for i in It[1:-1]:
	# Вычисление значений во внутренних узлах
	for i in Ix[1:-1]:
		y[i] = 2*y_2[i] - y_1[i] + \
		       gamma2*(y_1[i+1] - 2*y_1[i] + y_1[i-1])
	# Вычисление граничных условий
	i = Ix[0]; y[i] = 0
	i = Ix[-1]; y[i] = 0
# --- End snippet 4 ---
